src/InformationRegisters/НастройкиПравилРеестра/НастройкиПравилРеестра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПравилРеестра</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КластерыПлатформы/КластерыПлатформы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КластерыПлатформы</name>
  <resources>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортRAS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПутьКRac</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПортКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостояниеБаз/СостояниеБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеБаз</name>
  <resources>
    <name>ЗаданияЗапрещены</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СеансыЗапрещены</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСУБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧислоСеансов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбычноеЧислоСеансов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Сервер1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяБазы1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОчередьКоманд/ОчередьКоманд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьКоманд</name>
  <resources>
    <name>Команда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КонтрольБаз/КонтрольБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтрольБаз</name>
  <resources>
    <name>ДатаПервогоУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтключения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сервер1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяБазы1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ПравилаРеестраБаз/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Правила контроля реестра баз. Выполняются регламентными заданиями:
//   КонтрольВладельцевБаз        - база без владельца дольше срока;
//   КонтрольСрокаАктуальности - истёк срок актуальности (только тестовые базы).
//
// Внешние действия (SQL и кластер 1С) выполняются вызовом консольных утилит
// через ЗапуститьПриложение: COM-соединение не подходит, потому что кластеры
// работают на разных версиях платформы (1541 - 8.3.27.2214, 4541 - 8.3.27.2130,
// 7541 - 8.3.21.1624, 8541 - 8.3.27.2074), а COMConnector жёстко привязан к версии.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Регламентное задание. База без владельца дольше СрокаДней переводится в OFFLINE.
// Рабочие базы не отключаются никогда - по ним уходит только письмо.
Процедура КонтрольВладельцев() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ЗаписьЖурналаРегистрации("ПравилаРеестра.Владельцы", УровеньЖурналаРегистрации.Информация, , , "Старт");

	СрокДней        = ПравилаРеестраБаз.Настройка("СрокБезВладельцаДней", 30);
	СрокПервойВолны = ПравилаРеестраБаз.Настройка("СрокПервойВолныДней", 30);
	ЛимитЗаПрогон   = ПравилаРеестраБаз.Настройка("ЛимитОтключенийЗаПрогон", 5);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СерверыИБазы.Сервер1С       КАК Сервер1С,
	|	СерверыИБазы.ИмяБазы1С      КАК ИмяБазы1С,
	|	СерверыИБазы.СерверБД       КАК СерверБД,
	|	СерверыИБазы.ИмяБазыБД      КАК ИмяБазыБД,
	|	СерверыИБазы.Тип            КАК Тип,
	|	СерверыИБазы.Владелец       КАК Владелец
	|ИЗ
	|	РегистрСведений.СерверыИБазы КАК СерверыИБазы
	|ГДЕ
	|	СерверыИБазы.Владелец = ЗНАЧЕНИЕ(Справочник.Владелец.ПустаяСсылка)";

	Выборка = Запрос.Выполнить().Выбрать();

	Ключи = Новый Массив;
	Кандидаты = Новый Массив;
	ЕстьУчёт = ЕстьЗаписиКонтроля("Владелец");

	Пока Выборка.Следующий() Цикл

		Ключи.Добавить(КлючБазы(Выборка.Сервер1С, Выборка.ИмяБазы1С));
		Состояние = ПрочитатьСостояние("Владелец", Выборка.Сервер1С, Выборка.ИмяБазы1С);

		Если Состояние = Неопределено Тогда
			Срок = ?(ЕстьУчёт, СрокДней, СрокПервойВолны);
			ЗаписатьСостояние("Владелец", Выборка.Сервер1С, Выборка.ИмяБазы1С, Срок, "взята под контроль");
			Продолжить;
		КонецЕсли;

		Если (ТекущаяДатаСеанса() - Состояние.ДатаПервогоУведомления) / 86400 >= Состояние.СрокДней
			И НЕ ЗначениеЗаполнено(Состояние.ДатаОтключения) Тогда
			Кандидаты.Добавить(Новый Структура("Сервер1С,ИмяБазы1С,СерверБД,ИмяБазыБД,Тип,Владелец",
				Выборка.Сервер1С, Выборка.ИмяБазы1С, Выборка.СерверБД, Выборка.ИмяБазыБД, Выборка.Тип, Выборка.Владелец));
		КонецЕсли;

	КонецЦикла;

	СнятьЛишние("Владелец", Ключи);

	ЗаписьЖурналаРегистрации("ПравилаРеестра.Владельцы", УровеньЖурналаРегистрации.Информация, , ,
		"Итог: без владельца " + Ключи.Количество() + ", созрело для отключения " + Кандидаты.Количество());

	Если Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// Рабочие базы - только письмо, отключение не применяется
	КОтключению = Новый Массив;
	Для Каждого Кандидат Из Кандидаты Цикл
		Если Кандидат.Тип = Перечисления.ТипБазы.Рабочая Тогда
			Текст = "<p>Рабочая база <b>" + Кандидат.ИмяБазы1С + "</b> (" + Строка(Кандидат.Сервер1С) + ") "
				+ "числится в реестре без владельца.</p><p>База рабочая, поэтому автоматически не отключается. "
				+ "Проставьте владельца в реестре «Серверы и базы».</p>";
			ОтправитьПисьмо(Неопределено, "Реестр баз: рабочая база «" + Кандидат.ИмяБазы1С + "» без владельца", Текст);
			ОбновитьСтатус("Владелец", Кандидат.Сервер1С, Кандидат.ИмяБазы1С, "рабочая: отключение не применяется");
		Иначе
			КОтключению.Добавить(Кандидат);
		КонецЕсли;
	КонецЦикла;

	Если КОтключению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если КОтключению.Количество() > ЛимитЗаПрогон Тогда
		ОтправитьПисьмо(Неопределено, "Реестр баз: кандидатов на отключение больше лимита",
			"<p>Баз без владельца сверх срока: " + КОтключению.Количество() + ", лимит за прогон: " + ЛимитЗаПрогон
			+ ". Ничего не отключено, нужна ручная проверка.</p>");
		ЗаписьЖурналаРегистрации("КонтрольВладельцевБаз", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Кандидатов " + КОтключению.Количество() + " больше лимита " + ЛимитЗаПрогон + ", отключение не выполнялось");
		Возврат;
	КонецЕсли;

	Для Каждого База Из КОтключению Цикл
		ОтключитьБазу(База, "в реестре не указан владелец более " + СрокДней + " дн.", "Владелец");
	КонецЦикла;

КонецПроцедуры

// Регламентное задание. Истёк срок актуальности - письмо владельцу, а если он
// за отведённый срок дату не продлил, тестовая база переводится в OFFLINE и
// удаляется из кластера. Дата актуальности ведётся только у тестовых баз.
Процедура КонтрольСрокаАктуальности() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ЗаписьЖурналаРегистрации("ПравилаРеестра.Актуальность", УровеньЖурналаРегистрации.Информация, , , "Старт");

	СрокДней        = ПравилаРеестраБаз.Настройка("СрокПослеАктуальностиДней", 10);
	СрокПервойВолны = ПравилаРеестраБаз.Настройка("СрокПервойВолныДней", 30);
	ЛимитЗаПрогон   = ПравилаРеестраБаз.Настройка("ЛимитОтключенийЗаПрогон", 3);
	ПовторДней      = ПравилаРеестраБаз.Настройка("ПовторНапоминанияДней", 7);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СерверыИБазы.Сервер1С          КАК Сервер1С,
	|	СерверыИБазы.ИмяБазы1С         КАК ИмяБазы1С,
	|	СерверыИБазы.СерверБД          КАК СерверБД,
	|	СерверыИБазы.ИмяБазыБД         КАК ИмяБазыБД,
	|	СерверыИБазы.Тип               КАК Тип,
	|	СерверыИБазы.Владелец          КАК Владелец,
	|	СерверыИБазы.ДатаАктуальности  КАК ДатаАктуальности
	|ИЗ
	|	РегистрСведений.СерверыИБазы КАК СерверыИБазы
	|ГДЕ
	|	СерверыИБазы.ДатаАктуальности <> ДАТАВРЕМЯ(1,1,1)
	|	И СерверыИБазы.ДатаАктуальности <= &Сейчас
	|	И СерверыИБазы.Тип <> ЗНАЧЕНИЕ(Перечисление.ТипБазы.Рабочая)";
	Запрос.УстановитьПараметр("Сейчас", ТекущаяДатаСеанса());

	Выборка = Запрос.Выполнить().Выбрать();

	Ключи = Новый Массив;
	Просроченные = Новый Массив;
	ЕстьУчёт = ЕстьЗаписиКонтроля("Актуальность");

	Пока Выборка.Следующий() Цикл

		Ключи.Добавить(КлючБазы(Выборка.Сервер1С, Выборка.ИмяБазы1С));
		Состояние = ПрочитатьСостояние("Актуальность", Выборка.Сервер1С, Выборка.ИмяБазы1С);

		Если Состояние = Неопределено Тогда
			Срок = ?(ЕстьУчёт, СрокДней, СрокПервойВолны);
			ЗаписатьСостояние("Актуальность", Выборка.Сервер1С, Выборка.ИмяБазы1С, Срок, "истёк срок актуальности");

			Текст = "<p>База <b>" + Выборка.ИмяБазы1С + "</b> (" + Строка(Выборка.Сервер1С) + ") - истёк срок актуальности.</p>"
				+ "<p>Дата актуальности: " + Формат(Выборка.ДатаАктуальности, "ДФ=dd.MM.yyyy") + "<br>"
				+ "Владелец: " + ?(ЗначениеЗаполнено(Выборка.Владелец), Строка(Выборка.Владелец), "не указан") + "</p>"
				+ "<p>Продлите дату актуальности в реестре «Серверы и базы» в течение " + Срок + " дней, "
				+ "иначе база будет переведена в OFFLINE и удалена из кластера 1С. Файлы базы сохранятся.</p>";
			ОтправитьПисьмо(Выборка.Владелец, "Реестр баз: истёк срок актуальности базы «" + Выборка.ИмяБазы1С + "»", Текст);
			Продолжить;
		КонецЕсли;

		Если ЗначениеЗаполнено(Состояние.ДатаОтключения) Тогда
			Продолжить;
		КонецЕсли;

		ПрошлоДней = (ТекущаяДатаСеанса() - Состояние.ДатаПервогоУведомления) / 86400;
		Если ПрошлоДней >= Состояние.СрокДней Тогда
			Просроченные.Добавить(Новый Структура("Сервер1С,ИмяБазы1С,СерверБД,ИмяБазыБД,Тип,Владелец,ПрошлоДней",
				Выборка.Сервер1С, Выборка.ИмяБазы1С, Выборка.СерверБД, Выборка.ИмяБазыБД, Выборка.Тип, Выборка.Владелец, Цел(ПрошлоДней)));
		ИначеЕсли (ТекущаяДатаСеанса() - Состояние.ДатаПоследнегоУведомления) / 86400 >= ПовторДней Тогда
			Текст = "<p>Напоминание: у базы <b>" + Выборка.ИмяБазы1С + "</b> (" + Строка(Выборка.Сервер1С)
				+ ") срок актуальности истёк " + Цел(ПрошлоДней) + " дн. назад.</p>"
				+ "<p>Осталось " + (Состояние.СрокДней - Цел(ПрошлоДней)) + " дн. до отключения базы.</p>";
			ОтправитьПисьмо(Выборка.Владелец, "Реестр баз: напоминание по базе «" + Выборка.ИмяБазы1С + "»", Текст);
			ОбновитьСтатус("Актуальность", Выборка.Сервер1С, Выборка.ИмяБазы1С, "напоминание, " + Цел(ПрошлоДней) + " дн.");
		КонецЕсли;

	КонецЦикла;

	// Дату продлили - снимаем с контроля
	СнятьЛишние("Актуальность", Ключи);

	ЗаписьЖурналаРегистрации("ПравилаРеестра.Актуальность", УровеньЖурналаРегистрации.Информация, , ,
		"Итог: просрочено " + Ключи.Количество() + ", созрело для отключения " + Просроченные.Количество());

	Если Просроченные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если Просроченные.Количество() > ЛимитЗаПрогон Тогда
		ОтправитьПисьмо(Неопределено, "Реестр баз: кандидатов на отключение больше лимита",
			"<p>Баз с истёкшим сроком актуальности сверх отведённого времени: " + Просроченные.Количество()
			+ ", лимит за прогон: " + ЛимитЗаПрогон + ". Ничего не отключено, нужна ручная проверка.</p>");
		ЗаписьЖурналаРегистрации("КонтрольСрокаАктуальности", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Кандидатов " + Просроченные.Количество() + " больше лимита " + ЛимитЗаПрогон);
		Возврат;
	КонецЕсли;

	Для Каждого База Из Просроченные Цикл
		ОтключитьБазу(База, "дата актуальности не продлена в течение " + База.ПрошлоДней + " дн.", "Актуальность");
	КонецЦикла;

КонецПроцедуры

// Значение настройки правила. Настройки хранятся в регистре НастройкиПравилРеестра,
// при отсутствии значения возвращается значение по умолчанию.
//
// Параметры:
//  Имя - Строка - имя параметра в регистре НастройкиПравилРеестра.
//  ПоУмолчанию - Произвольный - значение, если настройка не задана или пуста.
//
// Возвращаемое значение:
//  Произвольный - значение настройки или ПоУмолчанию.
Функция Настройка(Имя, ПоУмолчанию) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1 НастройкиПравилРеестра.Значение КАК Значение
	|ИЗ РегистрСведений.НастройкиПравилРеестра КАК НастройкиПравилРеестра
	|ГДЕ НастройкиПравилРеестра.Параметр = &Параметр";
	Запрос.УстановитьПараметр("Параметр", Имя);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ПоУмолчанию;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат ?(ЗначениеЗаполнено(Выборка.Значение), Выборка.Значение, ПоУмолчанию);

КонецФункции

// Автоопределение кластеров 1С: порт, версия платформы, порт RAS, путь к rac.
// Раньше это соответствие было зашито в код константами - при установке нового
// кластера или обновлении платформы правила молча ломались на выборе утилиты.
Процедура ОбновитьКластеры() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации("Мониторинг.Кластеры", УровеньЖурналаРегистрации.Информация, , , "Старт");

	// Какие процессы менеджеров кластера сейчас запущены и из какого каталога платформы
	// Порт кластера берём из слушающих TCP-портов процесса rmngr, а версию платформы -
	// из пути к исполняемому файлу этого процесса.
	Команда = "powershell -NoProfile -Command ""$r=@{}; Get-CimInstance Win32_Process -Filter \"" Name='rmngr.exe' \"" | ForEach-Object { $r[[int]$_.ProcessId]=$_.ExecutablePath }; "
		+ "Get-NetTCPConnection -State Listen | Where-Object { $r.ContainsKey([int]$_.OwningProcess) } | "
		+ "ForEach-Object { \""$($_.LocalPort);$($r[[int]$_.OwningProcess])\"" } | Sort-Object -Unique""";

	Ответ = ВыполнитьКоманду(Команда);
	Найдено = 0;

	Для Каждого Строка Из СтрРазделить(Ответ.Вывод, Символы.ПС, Ложь) Цикл

		Части = СтрРазделить(СокрЛП(Строка), ";", Истина);
		Если Части.Количество() < 2 Тогда
			Продолжить;
		КонецЕсли;

		// Процесс rmngr слушает несколько портов; порт кластера оканчивается на 41 (1541, 4541, 7541, 8541)
		ПортСтрокой = СокрЛП(Части[0]);
		Если СтрДлина(ПортСтрокой) <> 4 ИЛИ Прав(ПортСтрокой, 2) <> "41" Тогда
			Продолжить;
		КонецЕсли;

		ПутьПроцесса = СокрЛП(Части[1]);
		Если НЕ ЗначениеЗаполнено(ПутьПроцесса) Тогда
			Продолжить;
		КонецЕсли;

		// C:\Program Files\1cv8\8.3.27.2214\bin\rmngr.exe -> версия и каталог bin
		Версия = "";
		Сегменты = СтрРазделить(ПутьПроцесса, "\", Ложь);
		Для Индекс = 0 По Сегменты.Количество() - 1 Цикл
			Если СтрНачинаетсяС(Сегменты[Индекс], "8.3.") Тогда
				Версия = Сегменты[Индекс];
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(Версия) Тогда
			Продолжить;
		КонецЕсли;

		ПортКластера = ПортСтрокой;

		МенеджерЗаписи = РегистрыСведений.КластерыПлатформы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПортКластера = ПортКластера;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ПортКластера   = ПортКластера;
		МенеджерЗаписи.ВерсияПлатформы = Версия;
		МенеджерЗаписи.ПортRAS        = Формат(Число(ПортКластера) + 4, "ЧГ=0");
		МенеджерЗаписи.ПутьКRac       = "C:\Program Files\1cv8\" + Версия + "\bin\rac.exe";
		МенеджерЗаписи.ДатаОбновления = ТекущаяДатаСеанса();
		МенеджерЗаписи.Записать(Истина);
		Найдено = Найдено + 1;

	КонецЦикла;

	ЗаписьЖурналаРегистрации("Мониторинг.Кластеры", УровеньЖурналаРегистрации.Информация, , ,
		"Итог: определено кластеров " + Найдено);

	// Внутридневные расписания ставятся программно (XML-расписание платформа не принимает).
	// Суточное задание переустанавливает их каждый день, чтобы не было круга с очередью команд.
	Попытка
		ИтогРасписаний = НастроитьРасписания();
	Исключение
		ИтогРасписаний = "ОШИБКА " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	ЗаписьЖурналаРегистрации("Мониторинг.Кластеры", УровеньЖурналаРегистрации.Информация, , ,
		"Расписания: " + ИтогРасписаний);

КонецПроцедуры

// Контроль доступности: заблокированы ли регламентные задания и сеансы в базах,
// в каком состоянии база в СУБД. Идея взята из 1sMonitor - именно на скрытой
// блокировке регламентных заданий мы потеряли много времени вслепую.
Процедура КонтрольДоступности() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации("Мониторинг.Доступность", УровеньЖурналаРегистрации.Информация, , , "Старт");

	Запреты = ЗапретыИзРеестровКластеров();

	Проблемы = Новый Массив;
	Проверено = 0;
	НеНайдено = 0;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СерверыИБазы.Сервер1С  КАК Сервер1С,
	|	СерверыИБазы.ИмяБазы1С КАК ИмяБазы1С,
	|	СерверыИБазы.СерверБД  КАК СерверБД,
	|	СерверыИБазы.ИмяБазыБД КАК ИмяБазыБД,
	|	СерверыИБазы.Тип       КАК Тип,
	|	СерверыИБазы.Владелец  КАК Владелец
	|ИЗ
	|	РегистрСведений.СерверыИБазы КАК СерверыИБазы
	|ГДЕ
	|	СерверыИБазы.Сервер1С <> ЗНАЧЕНИЕ(Справочник.Сервер1С.ПустаяСсылка)";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Проверено = Проверено + 1;

		// --- запреты в кластере: из файла реестра кластера, пароли баз не нужны ---
		Порт = "1541";
		Части = СтрРазделить(Строка(Выборка.Сервер1С), ":", Ложь);
		Если Части.Количество() > 1 Тогда
			Порт = СокрЛП(Части[1]);
		КонецЕсли;
		Запрет = Запреты.Получить(Порт + "|" + ВРег(СокрЛП(Выборка.ИмяБазы1С)));
		Если Запрет = Неопределено Тогда
			НеНайдено = НеНайдено + 1;
			ЗаданияЗапрещены = Ложь;
			СеансыЗапрещены  = Ложь;
		Иначе
			ЗаданияЗапрещены = Запрет.ЗаданияЗапрещены;
			СеансыЗапрещены  = Запрет.СеансыЗапрещены;
		КонецЕсли;

		// --- состояние базы в СУБД ---
		СостояниеСУБД = "";
		Если ЗначениеЗаполнено(Выборка.ИмяБазыБД) Тогда
			Сервер = ?(ЗначениеЗаполнено(Выборка.СерверБД), Строка(Выборка.СерверБД), "localhost");
			Ответ = ВыполнитьКоманду("sqlcmd -S """ + Сервер + """ -h -1 -W -Q ""SET NOCOUNT ON; SELECT state_desc FROM sys.databases WHERE name = '"
				+ Выборка.ИмяБазыБД + "'""");
			Для Каждого Строка Из СтрРазделить(Ответ.Вывод, Символы.ПС, Ложь) Цикл
				Стр = СокрЛП(Строка);
				Если Стр = "ONLINE" ИЛИ Стр = "OFFLINE" ИЛИ Стр = "RESTORING" ИЛИ Стр = "SUSPECT" ИЛИ Стр = "RECOVERY_PENDING" ИЛИ Стр = "EMERGENCY" Тогда
					СостояниеСУБД = Стр;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		// --- фиксация состояния ---
		МенеджерЗаписи = РегистрыСведений.СостояниеБаз.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Сервер1С  = Строка(Выборка.Сервер1С);
		МенеджерЗаписи.ИмяБазы1С = Выборка.ИмяБазы1С;
		МенеджерЗаписи.Прочитать();
		БылиЗаданияЗапрещены = МенеджерЗаписи.ЗаданияЗапрещены;
		БылоСостояние        = МенеджерЗаписи.СостояниеСУБД;

		МенеджерЗаписи.Сервер1С         = Строка(Выборка.Сервер1С);
		МенеджерЗаписи.ИмяБазы1С        = Выборка.ИмяБазы1С;
		МенеджерЗаписи.ЗаданияЗапрещены = ЗаданияЗапрещены;
		МенеджерЗаписи.СеансыЗапрещены  = СеансыЗапрещены;
		МенеджерЗаписи.СостояниеСУБД    = СостояниеСУБД;
		МенеджерЗаписи.ДатаПроверки     = ТекущаяДатаСеанса();
		МенеджерЗаписи.Записать(Истина);

		// Сообщаем только об изменениях, чтобы не слать одно и то же каждые 15 минут
		Если ЗаданияЗапрещены И НЕ БылиЗаданияЗапрещены Тогда
			Проблемы.Добавить("<b>" + Выборка.ИмяБазы1С + "</b> (" + Строка(Выборка.Сервер1С) + "): заблокированы регламентные задания");
		КонецЕсли;
		Если ЗначениеЗаполнено(СостояниеСУБД) И СостояниеСУБД <> "ONLINE" И СостояниеСУБД <> БылоСостояние Тогда
			Проблемы.Добавить("<b>" + Выборка.ИмяБазы1С + "</b>: база в СУБД в состоянии " + СостояниеСУБД);
		КонецЕсли;

	КонецЦикла;

	Если Проблемы.Количество() > 0 Тогда
		ОтправитьПисьмо(Неопределено, "Реестр баз: изменения в доступности баз",
			"<p>Обнаружены отклонения:</p><p>" + СтрСоединить(Проблемы, "<br>") + "</p>");
	КонецЕсли;

	ЗаписьЖурналаРегистрации("Мониторинг.Доступность", УровеньЖурналаРегистрации.Информация, , ,
		"Итог: проверено " + Проверено + ", отклонений " + Проблемы.Количество()
		+ ", не найдено в реестрах кластеров " + НеНайдено);

КонецПроцедуры

// Резкое падение числа сеансов - признак сбоя (идея из 1sMonitor).
// Сравниваем текущее число сеансов базы с её обычным значением за последние сутки.
Процедура КонтрольСеансов() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации("Мониторинг.Сеансы", УровеньЖурналаРегистрации.Информация, , , "Старт");

	ПорогПадения = Настройка("ПорогПаденияСеансовПроцент", 50);
	Учётка = УчётнаяЗаписьКластера();
	Если Учётка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Проблемы = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ СерверыИБазы.Сервер1С КАК Сервер1С
	|ИЗ РегистрСведений.СерверыИБазы КАК СерверыИБазы
	|ГДЕ СерверыИБазы.Сервер1С <> ЗНАЧЕНИЕ(Справочник.Сервер1С.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Rac = ПутьКRac(Выборка.Сервер1С);
		Если Rac = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Адрес = "localhost:" + Rac.ПортRAS;
		Кластер = ИдентификаторКластера(Rac, Адрес);
		Если НЕ ЗначениеЗаполнено(Кластер) Тогда
			Продолжить;
		КонецЕсли;

		Ответ = ВыполнитьКоманду("""" + Rac.Путь + """ " + Адрес + " session list --cluster=" + Кластер
			+ " --cluster-user=" + Учётка.Пользователь + " --cluster-pwd=" + Учётка.Пароль);

		// Считаем сеансы по каждой информационной базе
		ПоБазам = Новый Соответствие;
		ТекущаяИБ = "";
		Для Каждого Строка Из СтрРазделить(Ответ.Вывод, Символы.ПС, Ложь) Цикл
			Стр = СокрЛП(Строка);
			Если СтрНачинаетсяС(Стр, "infobase") И СтрНайти(Стр, ":") > 0 Тогда
				ТекущаяИБ = СокрЛП(Сред(Стр, СтрНайти(Стр, ":") + 1));
				ПоБазам.Вставить(ТекущаяИБ, ?(ПоБазам.Получить(ТекущаяИБ) = Неопределено, 1, ПоБазам.Получить(ТекущаяИБ) + 1));
			КонецЕсли;
		КонецЦикла;

		Для Каждого КЗ Из ПоБазам Цикл

			ИмяБазы = ИмяИБПоИдентификатору(Rac, Адрес, Кластер, Учётка, КЗ.Ключ);
			Если НЕ ЗначениеЗаполнено(ИмяБазы) Тогда
				Продолжить;
			КонецЕсли;

			МенеджерЗаписи = РегистрыСведений.СостояниеБаз.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Сервер1С  = Строка(Выборка.Сервер1С);
			МенеджерЗаписи.ИмяБазы1С = ИмяБазы;
			МенеджерЗаписи.Прочитать();

			Текущее = КЗ.Значение;
			Обычное = МенеджерЗаписи.ОбычноеЧислоСеансов;

			Если Обычное > 4 И Текущее * 100 / Обычное <= (100 - ПорогПадения) Тогда
				Проблемы.Добавить("<b>" + ИмяБазы + "</b>: сеансов " + Текущее + " против обычных " + Обычное);
			КонецЕсли;

			// Скользящее среднее, чтобы норма подстраивалась под жизнь базы
			МенеджерЗаписи.Сервер1С  = Строка(Выборка.Сервер1С);
			МенеджерЗаписи.ИмяБазы1С = ИмяБазы;
			МенеджерЗаписи.ЧислоСеансов = Текущее;
			МенеджерЗаписи.ОбычноеЧислоСеансов = ?(Обычное = 0, Текущее, Цел((Обычное * 5 + Текущее) / 6));
			МенеджерЗаписи.ДатаПроверки = ТекущаяДатаСеанса();
			МенеджерЗаписи.Записать(Истина);

		КонецЦикла;

	КонецЦикла;

	Если Проблемы.Количество() > 0 Тогда
		Текст = "<p>Резкое падение числа сеансов (порог " + ПорогПадения + "%):</p><p>" + СтрСоединить(Проблемы, "<br>") + "</p>";
		ОтправитьПисьмо(Неопределено, "Реестр баз: резкое падение числа сеансов", Текст);
		ОтправитьТелеграм(СтрЗаменить(СтрЗаменить(Текст, "<br>", Символы.ПС), "</p><p>", Символы.ПС));
	КонецЕсли;

	ЗаписьЖурналаРегистрации("Мониторинг.Сеансы", УровеньЖурналаРегистрации.Информация, , ,
		"Итог: отклонений " + Проблемы.Количество());

КонецПроцедуры

// Регламентное задание: обработчик очереди команд.
// Позволяет выполнять обслуживание базы без интерактивного входа: команда кладётся
// в регистр ОчередьКоманд (в том числе внешним скриптом), задание её выполняет и
// записывает результат. Нужно потому, что запуск внешних обработок и заданий вручную
// требует подтверждения человеком, а обслуживание должно идти автономно.
Процедура ОбработчикКоманд() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОчередьКоманд.Идентификатор КАК Идентификатор,
	|	ОчередьКоманд.Команда       КАК Команда,
	|	ОчередьКоманд.Параметр      КАК Параметр
	|ИЗ
	|	РегистрСведений.ОчередьКоманд КАК ОчередьКоманд
	|ГДЕ
	|	ОчередьКоманд.Состояние = ""новая""";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Результат = "";
		Попытка

			Если Выборка.Команда = "СнятьЗащиту" Тогда
				Результат = СнятьЗащитуОтОпасныхДействий(Выборка.Параметр);

			ИначеЕсли Выборка.Команда = "КонтрольВладельцев" Тогда
				КонтрольВладельцев();
				Результат = "выполнено";

			ИначеЕсли Выборка.Команда = "КонтрольАктуальности" Тогда
				КонтрольСрокаАктуальности();
				Результат = "выполнено";

			ИначеЕсли Выборка.Команда = "ОбновитьКластеры" Тогда
				ОбновитьКластеры();
				Результат = "выполнено";

			ИначеЕсли Выборка.Команда = "КонтрольДоступности" Тогда
				КонтрольДоступности();
				Результат = "выполнено";

			ИначеЕсли Выборка.Команда = "КонтрольСеансов" Тогда
				КонтрольСеансов();
				Результат = "выполнено";

			ИначеЕсли Выборка.Команда = "НастроитьРасписания" Тогда
				Результат = НастроитьРасписания();

			Иначе
				Результат = "неизвестная команда";
			КонецЕсли;

		Исключение
			Результат = "ОШИБКА: " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;

		МенеджерЗаписи = РегистрыСведений.ОчередьКоманд.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Идентификатор = Выборка.Идентификатор;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Идентификатор = Выборка.Идентификатор;
		МенеджерЗаписи.Команда   = Выборка.Команда;
		МенеджерЗаписи.Параметр  = Выборка.Параметр;
		МенеджерЗаписи.Состояние = "выполнена";
		МенеджерЗаписи.Результат = Лев(Результат, 500);
		МенеджерЗаписи.ДатаВыполнения = ТекущаяДатаСеанса();
		МенеджерЗаписи.Записать(Истина);

		ЗаписьЖурналаРегистрации("ПравилаРеестра.Команды", УровеньЖурналаРегистрации.Информация, , ,
			Выборка.Команда + " -> " + Результат);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Снимает у служебных учётных записей предупреждение об опасных действиях:
// иначе запуск rac и sqlcmd из фонового задания молча блокируется.
//
// Параметры:
//  СписокИмён - Строка - имена пользователей через запятую; пусто - все пользователи с префиксом "РЗ_".
//
// Возвращаемое значение:
//  Строка - результат по каждому пользователю через "; ".
Функция СнятьЗащитуОтОпасныхДействий(СписокИмён)

	Имена = Новый Массив;
	Если ЗначениеЗаполнено(СписокИмён) Тогда
		Для Каждого Имя Из СтрРазделить(СписокИмён, ",", Ложь) Цикл
			Имена.Добавить(СокрЛП(Имя));
		КонецЦикла;
	Иначе
		Для Каждого Пользователь Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
			Если СтрНачинаетсяС(Пользователь.Имя, "РЗ_") Тогда
				Имена.Добавить(Пользователь.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Готово = Новый Массив;
	Для Каждого Имя Из Имена Цикл
		ПользИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Имя);
		Если ПользИБ = Неопределено Тогда
			Готово.Добавить(Имя + ": не найден");
			Продолжить;
		КонецЕсли;
		Защита = ПользИБ.ЗащитаОтОпасныхДействий;
		Защита.ПредупреждатьОбОпасныхДействиях = Ложь;
		ПользИБ.ЗащитаОтОпасныхДействий = Защита;
		ПользИБ.Записать();
		Готово.Добавить(Имя + ": снята");
	КонецЦикла;

	Возврат СтрСоединить(Готово, "; ");

КонецФункции


Функция КлючБазы(Сервер1С, ИмяБазы1С)
	Возврат Строка(Сервер1С) + "|" + ИмяБазы1С;
КонецФункции

Функция ЕстьЗаписиКонтроля(Правило)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1 1 КАК Поле
	|ИЗ РегистрСведений.КонтрольБаз КАК т
	|ГДЕ т.Правило = &Правило";
	Запрос.УстановитьПараметр("Правило", Правило);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

Функция ПрочитатьСостояние(Правило, Сервер1С, ИмяБазы1С)

	МенеджерЗаписи = РегистрыСведений.КонтрольБаз.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Правило   = Правило;
	МенеджерЗаписи.Сервер1С  = Строка(Сервер1С);
	МенеджерЗаписи.ИмяБазы1С = ИмяБазы1С;
	МенеджерЗаписи.Прочитать();

	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("ДатаПервогоУведомления,ДатаПоследнегоУведомления,СрокДней,ДатаОтключения,Статус",
		МенеджерЗаписи.ДатаПервогоУведомления, МенеджерЗаписи.ДатаПоследнегоУведомления,
		МенеджерЗаписи.СрокДней, МенеджерЗаписи.ДатаОтключения, МенеджерЗаписи.Статус);

КонецФункции

Процедура ЗаписатьСостояние(Правило, Сервер1С, ИмяБазы1С, СрокДней, Статус)

	МенеджерЗаписи = РегистрыСведений.КонтрольБаз.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Правило   = Правило;
	МенеджерЗаписи.Сервер1С  = Строка(Сервер1С);
	МенеджерЗаписи.ИмяБазы1С = ИмяБазы1С;
	МенеджерЗаписи.ДатаПервогоУведомления   = ТекущаяДатаСеанса();
	МенеджерЗаписи.ДатаПоследнегоУведомления = ТекущаяДатаСеанса();
	МенеджерЗаписи.СрокДней = СрокДней;
	МенеджерЗаписи.Статус   = Статус;
	МенеджерЗаписи.Записать(Истина);

КонецПроцедуры

Процедура ОбновитьСтатус(Правило, Сервер1С, ИмяБазы1С, Статус, ДатаОтключения = Неопределено)

	МенеджерЗаписи = РегистрыСведений.КонтрольБаз.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Правило   = Правило;
	МенеджерЗаписи.Сервер1С  = Строка(Сервер1С);
	МенеджерЗаписи.ИмяБазы1С = ИмяБазы1С;
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;
	МенеджерЗаписи.ДатаПоследнегоУведомления = ТекущаяДатаСеанса();
	МенеджерЗаписи.Статус = Лев(Статус, 500);
	Если ДатаОтключения <> Неопределено Тогда
		МенеджерЗаписи.ДатаОтключения = ДатаОтключения;
	КонецЕсли;
	МенеджерЗаписи.Записать(Истина);

КонецПроцедуры

// Снимает с контроля базы, которых больше нет в выборке правила
// (владельца проставили или дату актуальности продлили).
//
// Параметры:
//  Правило - Строка - имя правила: "Владелец" или "Актуальность".
//  Ключи - Массив из Строка - ключи баз текущей выборки правила, см. КлючБазы.
Процедура СнятьЛишние(Правило, Ключи)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ т.Сервер1С КАК Сервер1С, т.ИмяБазы1С КАК ИмяБазы1С
	|ИЗ РегистрСведений.КонтрольБаз КАК т
	|ГДЕ т.Правило = &Правило И т.ДатаОтключения = ДАТАВРЕМЯ(1,1,1)";
	Запрос.УстановитьПараметр("Правило", Правило);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Ключи.Найти(Выборка.Сервер1С + "|" + Выборка.ИмяБазы1С) = Неопределено Тогда
			МенеджерЗаписи = РегистрыСведений.КонтрольБаз.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Правило   = Правило;
			МенеджерЗаписи.Сервер1С  = Выборка.Сервер1С;
			МенеджерЗаписи.ИмяБазы1С = Выборка.ИмяБазы1С;
			МенеджерЗаписи.Удалить();
			ЗаписьЖурналаРегистрации("ПравилаРеестра." + Правило, УровеньЖурналаРегистрации.Информация, , ,
				"Снята с контроля: " + Выборка.ИмяБазы1С);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Письмо владельцу базы (если у него заполнена почта) с копией администраторам.
//
// Параметры:
//  Владелец - СправочникСсылка.Владелец, Неопределено - владелец базы; Неопределено - письмо только администраторам.
//  Тема - Строка - тема письма.
//  ТекстHTML - Строка - текст письма в формате HTML.
Процедура ОтправитьПисьмо(Владелец, Тема, ТекстHTML)

	Адреса = Новый Массив;
	Если Владелец <> Неопределено И ЗначениеЗаполнено(Владелец) Тогда
		Почта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Почта");
		Если ЗначениеЗаполнено(Почта) Тогда
			Адреса.Добавить(Почта);
		КонецЕсли;
	КонецЕсли;

	СтрокаКопий = Настройка("АдресаАдминистраторов", "rentonekb@gmail.com,i.pohozhaev@activelogic.ru");
	Для Каждого Адрес Из СтрРазделить(СтрокаКопий, ",", Ложь) Цикл
		Если ЗначениеЗаполнено(СокрЛП(Адрес)) Тогда
			Адреса.Добавить(СокрЛП(Адрес));
		КонецЕсли;
	КонецЦикла;

	Если Адреса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	МодульРегламентныеЗадания.ОтправитьПисьмоПоБСП(Адреса, Тема, ТекстHTML);

КонецПроцедуры

// Путь к rac той версии платформы, на которой работает нужный кластер:
// у каждого кластера своя версия, поэтому одной утилитой обойтись нельзя.
//
// Параметры:
//  Сервер1С - СправочникСсылка.Сервер1С - сервер кластера в виде "имя:порт".
//
// Возвращаемое значение:
//  Структура, Неопределено - поля Путь и ПортRAS (Строка);
//   Неопределено, если версия платформы для порта неизвестна.
Функция ПутьКRac(Сервер1С)

	// Соответствие портов и версий платформы заполняет задание <<Обновление кластеров>>.
	// Значения ниже - резерв, если автоопределение ещё не отработало.
	Версии = Новый Соответствие;
	ЗапросВерсий = Новый Запрос("ВЫБРАТЬ КластерыПлатформы.ПортКластера КАК Порт, КластерыПлатформы.ВерсияПлатформы КАК Версия ИЗ РегистрСведений.КластерыПлатформы КАК КластерыПлатформы");
	ВыборкаВерсий = ЗапросВерсий.Выполнить().Выбрать();
	Пока ВыборкаВерсий.Следующий() Цикл
		Версии.Вставить(СокрЛП(ВыборкаВерсий.Порт), СокрЛП(ВыборкаВерсий.Версия));
	КонецЦикла;
	Если Версии.Количество() = 0 Тогда
		Версии.Вставить("1541", "8.3.27.2214");
		Версии.Вставить("4541", "8.3.27.2130_v2");
		Версии.Вставить("7541", "8.3.21.1624");
		Версии.Вставить("8541", "8.3.27.2074");
	КонецЕсли;

	Порт = "1541";
	Части = СтрРазделить(Строка(Сервер1С), ":", Ложь);
	Если Части.Количество() > 1 Тогда
		Порт = СокрЛП(Части[1]);
	КонецЕсли;

	Версия = Версии.Получить(Порт);
	Если Версия = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("Путь,ПортRAS",
		"C:\Program Files\1cv8\" + Версия + "\bin\rac.exe", Формат(Число(Порт) + 4, "ЧГ=0"));

КонецФункции

// Выполняет консольную команду и возвращает её вывод.
//
// Параметры:
//  КоманднаяСтрока - Строка - команда для cmd.exe.
//
// Возвращаемое значение:
//  Структура - поля КодВозврата (Число) и Вывод (Строка, stdout и stderr в кодировке cp866).
Функция ВыполнитьКоманду(КоманднаяСтрока)

	ФайлВывода = ПолучитьИмяВременногоФайла("out");
	КодВозврата = 0;
	Попытка
		ЗапуститьПриложение("cmd.exe /c " + КоманднаяСтрока + " > """ + ФайлВывода + """ 2>&1", , Истина, КодВозврата);
	Исключение
		Возврат Новый Структура("КодВозврата,Вывод", -1, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Вывод = "";
	Попытка
		Чтение = Новый ЧтениеТекста(ФайлВывода, "cp866");
		Вывод = Чтение.Прочитать();
		Чтение.Закрыть();
		УдалитьФайлы(ФайлВывода);
	Исключение
		Вывод = "";
	КонецПопытки;

	Возврат Новый Структура("КодВозврата,Вывод", КодВозврата, ?(Вывод = Неопределено, "", Вывод));

КонецФункции

// Логин и пароль администратора кластера хранятся вне конфигурации.
//
// Возвращаемое значение:
//  Структура, Неопределено - поля Пользователь и Пароль (Строка);
//   Неопределено, если файл не прочитан или в нём нет двух значений через табуляцию.
Функция УчётнаяЗаписьКластера()

	Путь = Настройка("ФайлУчётнойЗаписиКластера", "C:\Kirill\OwnerGuard\cluster.cred");
	Попытка
		Чтение = Новый ЧтениеТекста(Путь, "UTF-8");
		Строка = СокрЛП(Чтение.Прочитать());
		Чтение.Закрыть();
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Части = СтрРазделить(Строка, Символы.Таб, Ложь);
	Если Части.Количество() < 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Новый Структура("Пользователь,Пароль", СокрЛП(Части[0]), СокрЛП(Части[1]));

КонецФункции

// Есть ли сейчас сеансы в базе. Активную базу не отключаем.
//
// Параметры:
//  Сервер1С - СправочникСсылка.Сервер1С - сервер кластера.
//  ИмяБазы1С - Строка - имя информационной базы в кластере.
//
// Возвращаемое значение:
//  Структура - поля Ошибка (Строка, пусто при успехе) и Сеансы (Массив из Строка вида "пользователь @ хост").
Функция АктивныеСеансы(Сервер1С, ИмяБазы1С)

	Результат = Новый Структура("Ошибка,Сеансы", "", Новый Массив);

	Rac = ПутьКRac(Сервер1С);
	Если Rac = Неопределено Тогда
		Результат.Ошибка = "Неизвестный кластер: " + Строка(Сервер1С);
		Возврат Результат;
	КонецЕсли;

	Учётка = УчётнаяЗаписьКластера();
	Если Учётка = Неопределено Тогда
		Результат.Ошибка = "Не удалось прочитать учётную запись администратора кластера";
		Возврат Результат;
	КонецЕсли;

	База = "localhost:" + Rac.ПортRAS;
	Ответ = ВыполнитьКоманду("""" + Rac.Путь + """ " + База + " cluster list");
	Кластер = "";
	Для Каждого Строка Из СтрРазделить(Ответ.Вывод, Символы.ПС, Ложь) Цикл
		Если СтрНачинаетсяС(СокрЛП(Строка), "cluster") Тогда
			Части = СтрРазделить(Строка, ":", Ложь);
			Если Части.Количество() > 1 Тогда
				Кластер = СокрЛП(Части[1]);
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если НЕ ЗначениеЗаполнено(Кластер) Тогда
		Результат.Ошибка = "Не удалось определить кластер: " + Ответ.Вывод;
		Возврат Результат;
	КонецЕсли;

	ИБ = ИдентификаторИБ(Rac, База, Кластер, Учётка, ИмяБазы1С);
	Если НЕ ЗначениеЗаполнено(ИБ) Тогда
		Результат.Ошибка = "Информационная база не найдена в кластере";
		Возврат Результат;
	КонецЕсли;

	Ответ = ВыполнитьКоманду("""" + Rac.Путь + """ " + База + " session list --cluster=" + Кластер
		+ " --cluster-user=" + Учётка.Пользователь + " --cluster-pwd=" + Учётка.Пароль);

	ТекущаяИБ = ""; Пользователь = ""; Хост = "";
	Для Каждого Строка Из СтрРазделить(Ответ.Вывод, Символы.ПС, Ложь) Цикл
		Стр = СокрЛП(Строка);
		Если Стр = "" Тогда
			Если ТекущаяИБ = ИБ Тогда
				Результат.Сеансы.Добавить(Пользователь + " @ " + Хост);
			КонецЕсли;
			ТекущаяИБ = ""; Пользователь = ""; Хост = "";
			Продолжить;
		КонецЕсли;
		Если СтрНачинаетсяС(Стр, "infobase ") Или СтрНачинаетсяС(Стр, "infobase:") Тогда
			ТекущаяИБ = СокрЛП(Сред(Стр, СтрНайти(Стр, ":") + 1));
		ИначеЕсли СтрНачинаетсяС(Стр, "user-name") Тогда
			Пользователь = СокрЛП(Сред(Стр, СтрНайти(Стр, ":") + 1));
		ИначеЕсли СтрНачинаетсяС(Стр, "host") Тогда
			Хост = СокрЛП(Сред(Стр, СтрНайти(Стр, ":") + 1));
		КонецЕсли;
	КонецЦикла;
	Если ТекущаяИБ = ИБ Тогда
		Результат.Сеансы.Добавить(Пользователь + " @ " + Хост);
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ИдентификаторИБ(Rac, База, Кластер, Учётка, ИмяБазы1С)

	Ответ = ВыполнитьКоманду("""" + Rac.Путь + """ " + База + " infobase summary list --cluster=" + Кластер
		+ " --cluster-user=" + Учётка.Пользователь + " --cluster-pwd=" + Учётка.Пароль);

	Текущий = "";
	Для Каждого Строка Из СтрРазделить(Ответ.Вывод, Символы.ПС, Ложь) Цикл
		Стр = СокрЛП(Строка);
		Если СтрНачинаетсяС(Стр, "infobase") Тогда
			Текущий = СокрЛП(Сред(Стр, СтрНайти(Стр, ":") + 1));
		ИначеЕсли СтрНачинаетсяС(Стр, "name") Тогда
			Если СокрЛП(Сред(Стр, СтрНайти(Стр, ":") + 1)) = ИмяБазы1С Тогда
				Возврат Текущий;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

// Перевод базы в OFFLINE и удаление информационной базы из кластера.
//
// Параметры:
//  База - Структура - поля Сервер1С, ИмяБазы1С, СерверБД, ИмяБазыБД, Тип, Владелец.
//  Причина - Строка - причина отключения для письма и статуса.
//  Правило - Строка - имя правила в регистре КонтрольБаз.
Процедура ОтключитьБазу(База, Причина, Правило)

	Проверка = АктивныеСеансы(База.Сервер1С, База.ИмяБазы1С);

	Если ЗначениеЗаполнено(Проверка.Ошибка) Тогда
		ОбновитьСтатус(Правило, База.Сервер1С, База.ИмяБазы1С, "отключение отменено: " + Проверка.Ошибка);
		ЗаписьЖурналаРегистрации("ПравилаРеестра." + Правило, УровеньЖурналаРегистрации.Предупреждение, , ,
			База.ИмяБазы1С + ": " + Проверка.Ошибка);
		Возврат;
	КонецЕсли;

	Если Проверка.Сеансы.Количество() > 0 Тогда
		Текст = "<p>База <b>" + База.ИмяБазы1С + "</b> (" + Строка(База.Сервер1С) + ") подлежала отключению ("
			+ Причина + "), но ею пользуются - отключение отменено.</p><p>Активные сеансы:<br>"
			+ СтрСоединить(Проверка.Сеансы, "<br>") + "</p>";
		ОтправитьПисьмо(База.Владелец, "Реестр баз: база «" + База.ИмяБазы1С + "» активна, отключение отменено", Текст);
		ОбновитьСтатус(Правило, База.Сервер1С, База.ИмяБазы1С, "активна, отключение отменено");
		Возврат;
	КонецЕсли;

	Статус = Новый Массив;

	// 1. база СУБД в OFFLINE
	СерверSQL = ?(ЗначениеЗаполнено(База.СерверБД), Строка(База.СерверБД), "localhost");
	Команда = "sqlcmd -S """ + СерверSQL + """ -b -Q ""ALTER DATABASE [" + База.ИмяБазыБД + "] SET OFFLINE WITH ROLLBACK AFTER 60""";
	Ответ = ВыполнитьКоманду(Команда);
	Если Ответ.КодВозврата = 0 Тогда
		Статус.Добавить("СУБД: OFFLINE");
	Иначе
		Статус.Добавить("СУБД: ошибка (" + Ответ.КодВозврата + ") " + Лев(Ответ.Вывод, 200));
	КонецЕсли;

	// 2. удаление информационной базы из кластера, файлы базы остаются
	Rac = ПутьКRac(База.Сервер1С);
	Учётка = УчётнаяЗаписьКластера();
	Если Rac <> Неопределено И Учётка <> Неопределено Тогда
		Адрес = "localhost:" + Rac.ПортRAS;
		Ответ = ВыполнитьКоманду("""" + Rac.Путь + """ " + Адрес + " cluster list");
		Кластер = "";
		Для Каждого Строка Из СтрРазделить(Ответ.Вывод, Символы.ПС, Ложь) Цикл
			Если СтрНачинаетсяС(СокрЛП(Строка), "cluster") Тогда
				Части = СтрРазделить(Строка, ":", Ложь);
				Если Части.Количество() > 1 Тогда
					Кластер = СокрЛП(Части[1]);
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ИБ = ?(ЗначениеЗаполнено(Кластер), ИдентификаторИБ(Rac, Адрес, Кластер, Учётка, База.ИмяБазы1С), "");
		Если ЗначениеЗаполнено(ИБ) Тогда
			Ответ = ВыполнитьКоманду("""" + Rac.Путь + """ " + Адрес + " infobase drop --cluster=" + Кластер
				+ " --cluster-user=" + Учётка.Пользователь + " --cluster-pwd=" + Учётка.Пароль + " --infobase=" + ИБ);
			Статус.Добавить(?(Ответ.КодВозврата = 0, "кластер: ИБ удалена", "кластер: удалить не удалось"));
		Иначе
			Статус.Добавить("кластер: ИБ не найдена");
		КонецЕсли;
	Иначе
		Статус.Добавить("кластер: нет данных для подключения");
	КонецЕсли;

	ОбновитьСтатус(Правило, База.Сервер1С, База.ИмяБазы1С, СтрСоединить(Статус, "; "), ТекущаяДатаСеанса());

	Текст = "<p>База <b>" + База.ИмяБазы1С + "</b> (" + Строка(База.Сервер1С) + ") отключена.</p>"
		+ "<p>Причина: " + Причина + "<br>"
		+ "Владелец: " + ?(ЗначениеЗаполнено(База.Владелец), Строка(База.Владелец), "не указан") + "<br>"
		+ "Выполнено: " + СтрСоединить(Статус, "; ") + "</p>"
		+ "<p>Файлы базы сохранены. Для возврата: ALTER DATABASE [" + База.ИмяБазыБД + "] SET ONLINE "
		+ "и повторное добавление информационной базы в кластер.</p>";
	ОтправитьПисьмо(База.Владелец, "Реестр баз: база «" + База.ИмяБазы1С + "» отключена", Текст);

	ЗаписьЖурналаРегистрации("ПравилаРеестра." + Правило, УровеньЖурналаРегистрации.Информация, , ,
		База.ИмяБазы1С + " отключена: " + СтрСоединить(Статус, "; "));

КонецПроцедуры

// Идентификатор кластера по адресу RAS.
//
// Параметры:
//  Rac - Структура - результат ПутьКRac.
//  Адрес - Строка - адрес RAS вида "localhost:1545".
//
// Возвращаемое значение:
//  Строка - идентификатор первого кластера; пусто, если не найден.
Функция ИдентификаторКластера(Rac, Адрес)

	Ответ = ВыполнитьКоманду("""" + Rac.Путь + """ " + Адрес + " cluster list");
	Для Каждого Строка Из СтрРазделить(Ответ.Вывод, Символы.ПС, Ложь) Цикл
		Стр = СокрЛП(Строка);
		Если СтрНачинаетсяС(Стр, "cluster") И СтрНайти(Стр, ":") > 0 Тогда
			Возврат СокрЛП(Сред(Стр, СтрНайти(Стр, ":") + 1));
		КонецЕсли;
	КонецЦикла;
	Возврат "";

КонецФункции

// Имя информационной базы по её идентификатору в кластере.
//
// Параметры:
//  Rac - Структура - результат ПутьКRac.
//  Адрес - Строка - адрес RAS.
//  Кластер - Строка - идентификатор кластера.
//  Учётка - Структура - результат УчётнаяЗаписьКластера.
//  Идентификатор - Строка - идентификатор информационной базы.
//
// Возвращаемое значение:
//  Строка - имя базы; пусто, если не найдена.
Функция ИмяИБПоИдентификатору(Rac, Адрес, Кластер, Учётка, Идентификатор)

	Ответ = ВыполнитьКоманду("""" + Rac.Путь + """ " + Адрес + " infobase summary list --cluster=" + Кластер
		+ " --cluster-user=" + Учётка.Пользователь + " --cluster-pwd=" + Учётка.Пароль);

	Текущий = "";
	Для Каждого Строка Из СтрРазделить(Ответ.Вывод, Символы.ПС, Ложь) Цикл
		Стр = СокрЛП(Строка);
		Если СтрНачинаетсяС(Стр, "infobase") И СтрНайти(Стр, ":") > 0 Тогда
			Текущий = СокрЛП(Сред(Стр, СтрНайти(Стр, ":") + 1));
		ИначеЕсли СтрНачинаетсяС(Стр, "name") И Текущий = Идентификатор Тогда
			Возврат СокрЛП(Сред(Стр, СтрНайти(Стр, ":") + 1));
		КонецЕсли;
	КонецЦикла;
	Возврат "";

КонецФункции

// Запреты регламентных заданий и сеансов по базам всех кластеров сервера.
// Флаги хранятся в реестре кластера (1CV8Clst.lst), а не в самой базе, поэтому
// пароли пользователей баз не нужны: у каждой базы он свой.
// Запись базы в файле - строка "{uuid,"имя",...", следующая за ней строка
// "{запрет сеансов,с,по,...},запрет заданий,выдача лицензий,...".
//
// Возвращаемое значение:
//  Соответствие - ключ "порт|ИМЯ БАЗЫ" (имя в верхнем регистре),
//   значение - Структура с полями ЗаданияЗапрещены и СеансыЗапрещены (Булево).
Функция ЗапретыИзРеестровКластеров()

	Результат = Новый Соответствие;

	// Каталоги служб кластеров: <корень>\srvinfo*\reg_<порт> или <корень>\srvinfo*\<каталог>\reg_<порт>.
	Корень = Настройка("КаталогСлужбКластеров", "D:\1cv8");
	Реестры = Новый Массив;
	Для Каждого Каталог Из НайтиФайлы(Корень, "srvinfo*", Ложь) Цикл
		Если НЕ Каталог.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Вложенный Из НайтиФайлы(Каталог.ПолноеИмя, "*", Ложь) Цикл
			Если НЕ Вложенный.ЭтоКаталог() Тогда
				Продолжить;
			ИначеЕсли СтрНачинаетсяС(НРег(Вложенный.Имя), "reg_") Тогда
				Реестры.Добавить(Вложенный);
			Иначе
				Для Каждого Реестр Из НайтиФайлы(Вложенный.ПолноеИмя, "reg_*", Ложь) Цикл
					Если Реестр.ЭтоКаталог() Тогда
						Реестры.Добавить(Реестр);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Для Каждого Реестр Из Реестры Цикл

		ИмяФайла = Реестр.ПолноеИмя + ПолучитьРазделительПути() + "1CV8Clst.lst";
		ФайлРеестра = Новый Файл(ИмяФайла);
		Если НЕ ФайлРеестра.Существует() Тогда
			Продолжить;
		КонецЕсли;
		Порт = Сред(Реестр.Имя, 5);

		Попытка
			Чтение = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
			Текст = Чтение.Прочитать();
			Чтение.Закрыть();
		Исключение
			ЗаписьЖурналаРегистрации("Мониторинг.Доступность", УровеньЖурналаРегистрации.Предупреждение, , ,
				"Не прочитан реестр кластера " + ИмяФайла + ": "
				+ ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
		КонецПопытки;
		Если НЕ ЗначениеЗаполнено(Текст) Тогда
			Продолжить;
		КонецЕсли;

		Строки = СтрРазделить(СтрЗаменить(Текст, Символы.ВК, ""), Символы.ПС, Ложь);
		Для Индекс = 0 По Строки.Количество() - 2 Цикл
			Заголовок = Строки[Индекс];
			Блок = Строки[Индекс + 1];
			Если СтрДлина(Заголовок) < 40 ИЛИ Лев(Заголовок, 1) <> "{" ИЛИ Сред(Заголовок, 38, 2) <> ",""" Тогда
				Продолжить;
			КонецЕсли;
			Если СтрДлина(Блок) < 20 ИЛИ Лев(Блок, 1) <> "{" ИЛИ Сред(Блок, 3, 1) <> "," ИЛИ Сред(Блок, 18, 1) <> "," Тогда
				Продолжить;
			КонецЕсли;
			КонецИмени = СтрНайти(Заголовок, """,""", НаправлениеПоиска.СНачала, 40);
			ПозицияЗаданий = СтрНайти(Блок, "},");
			Если КонецИмени = 0 ИЛИ ПозицияЗаданий = 0 Тогда
				Продолжить;
			КонецЕсли;
			Имя = СокрЛП(Сред(Заголовок, 40, КонецИмени - 40));
			Результат.Вставить(Порт + "|" + ВРег(Имя), Новый Структура("ЗаданияЗапрещены,СеансыЗапрещены",
				Сред(Блок, ПозицияЗаданий + 2, 1) = "1", Сред(Блок, 2, 1) = "1"));
		КонецЦикла;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Уведомление в Telegram через VPS: у сервера нет прямого доступа к api.telegram.org.
//
// Параметры:
//  Текст - Строка - текст сообщения.
Процедура ОтправитьТелеграм(Текст)

	Ключ = Настройка("КлючSSHТелеграм", "C:\Kirill\OwnerGuard\id_ed25519_tg");
	Хост = Настройка("ХостТелеграмРелея", "root@45.86.181.152");

	Кодировка = Новый ТекстовыйДокумент;
	Кодировка.УстановитьТекст(Текст);
	ВременныйФайл = ПолучитьИмяВременногоФайла("txt");
	Кодировка.Записать(ВременныйФайл, КодировкаТекста.UTF8);

	Попытка
		Команда = "powershell -NoProfile -Command ""$t = Get-Content -Raw -Encoding UTF8 '" + ВременныйФайл + "'; "
			+ "$b = [Convert]::ToBase64String([Text.Encoding]::UTF8.GetBytes($t)); "
			+ "$b | ssh -i '" + Ключ + "' -o StrictHostKeyChecking=no -o BatchMode=yes -o ConnectTimeout=15 " + Хост + """";
		ВыполнитьКоманду(Команда);
	Исключение
		ЗаписьЖурналаРегистрации("Мониторинг.Телеграм", УровеньЖурналаРегистрации.Предупреждение, , ,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	УдалитьФайлы(ВременныйФайл);

КонецПроцедуры

// Расписания задаём программно: заданное вручную в XML расширения платформа
// не приняла - задания числились включёнными, но не запускались ни разу.
//
// Возвращаемое значение:
//  Строка - итог по каждому заданию через "; ".
Функция НастроитьРасписания()

	Внутридневные = Новый Соответствие;
	Внутридневные.Вставить("ОбработчикКомандОбслуживания", 300);
	Внутридневные.Вставить("КонтрольДоступностиБаз", 900);
	Внутридневные.Вставить("КонтрольСеансовБаз", 900);

	Суточные = Новый Соответствие;
	Суточные.Вставить("КонтрольВладельцевБаз", 23400);
	Суточные.Вставить("КонтрольСрокаАктуальности", 25200);
	Суточные.Вставить("ОбновлениеКластеров", 19800);

	Готово = Новый Массив;

	Для Каждого КЗ Из Внутридневные Цикл
		Попытка
			МД = Метаданные.РегламентныеЗадания.Найти(КЗ.Ключ);
			Если МД = Неопределено Тогда
				Готово.Добавить(КЗ.Ключ + ": не найдено");
				Продолжить;
			КонецЕсли;
			Задание = РегламентныеЗадания.НайтиПредопределенное(МД);
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ПериодПовтораДней = 1;
			Расписание.ВремяНачала = Дата(1, 1, 1, 0, 2, 0);
			Расписание.ВремяКонца = Дата(1, 1, 1, 23, 59, 0);
			// В разных версиях платформы свойство пишется по-разному - пробуем оба варианта.
			ПериодУстановлен = Ложь;
			Попытка
				Расписание.ПериодПовтораВТеченииДня = КЗ.Значение;
				ПериодУстановлен = Истина;
			Исключение
			КонецПопытки;
			Если НЕ ПериодУстановлен Тогда
				Попытка
					Расписание.ПериодПовтораВТечениеДня = КЗ.Значение;
					ПериодУстановлен = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
			Задание.Расписание = Расписание;
			Задание.Использование = Истина;
			Задание.Записать();
			Готово.Добавить(КЗ.Ключ + ": каждые " + КЗ.Значение / 60 + " мин, период " + ?(ПериодУстановлен, "установлен", "НЕ УСТАНОВЛЕН"));
		Исключение
			Готово.Добавить(КЗ.Ключ + ": ОШИБКА " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

	Для Каждого КЗ Из Суточные Цикл
		Попытка
			МД = Метаданные.РегламентныеЗадания.Найти(КЗ.Ключ);
			Если МД = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Задание = РегламентныеЗадания.НайтиПредопределенное(МД);
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ПериодПовтораДней = 1;
			Расписание.ВремяНачала = Дата(1, 1, 1, 0, 0, 0) + КЗ.Значение;
			Задание.Расписание = Расписание;
			Задание.Использование = Истина;
			Задание.Записать();
			Готово.Добавить(КЗ.Ключ + ": ежедневно");
		Исключение
			Готово.Добавить(КЗ.Ключ + ": ОШИБКА " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

	Возврат СтрСоединить(Готово, "; ");

КонецФункции

#КонецОбласти
